<?php
//其他配置文件
return [
    //封禁帐号/角色
    0 => [
        '无',
        '使用外挂',
        '刷广告',
        '账号异常'
    ],
    //解封类型
    1 => [
        '误封',
        '巴拉巴拉'
    ],
    //道具变动类型
    2 => [
        '增加',
        '减少',
        '更新',
        '消耗',
        '交换',
        '合并'
    ],
    //货币变动类型
    3 => [
        '增加+',
        '减少-'
    ],
    //公告类型
    4 => [
        '登录前',
        '游戏内',
    ],
    //服务器网络状态
    5 => [
        '流畅',
        '爆满',
        '繁忙',
        '维护',
    ],

    //货币类型
    6 => [
        [
            'val' => 0,
            'coin' => '全部(查询用)'
        ],
        [
            'val' => 1,
            'coin' => '1-体力'
        ],
        [
            'val' => 2,
            'coin' => '2-钻石'
        ],
        [
            'val' => 3,
            'coin' => '3-金币'
        ],
        [
            'val' => 4,
            'coin' => '4-小宝箱钥匙'
        ],
        [
            'val' => 5,
            'coin' => '5-大宝箱钥匙'
        ],
        [
            'val' => 6,
            'coin' => '6-石材'
        ],
        [
            'val' => 7,
            'coin' => '7-木材'
        ],
        [
            'val' => 8,
            'coin' => '8-锻造石'
        ],
        [
            'val' => 9,
            'coin' => '9-天赋石'
        ],
        [
            'val' => 10,
            'coin' => '10-兽粮'
        ],
        [
            'val' => 11,
            'coin' => '11-星币'
        ],
        [
            'val' => 12,
            'coin' => '12-命运钥匙'
        ],
        [
            'val' => 13,
            'coin' => '13-星币(掉落用)'
        ],
		[
            'val' => 14,
            'coin' => '14-经验'
        ]
    ],

    //玩家帐号权限
    9 => [
        '普通帐号',
        '普通GM帐号',
        '客服组长',
        '客服主管',
        '客服经理',
        '技术人员',
    ],

    //货币消耗类型
    10 => [
        1 => '活动开始减少体力',
        2 => '兑换货币',
        3 => '小宝箱抽奖消耗钥匙',
        4 => '小宝箱抽奖消耗钻石',
        5 => '大宝箱抽奖消耗钥匙',
        6 => '大宝箱抽奖消耗钻石',
        7 => '宠物解锁',
        8 => '宠物升级',
        9 => '装备槽升级',
        10 => '复活',
        11 => '建筑升级',
        12 => '物品制作',
        13 => '建筑制作装备',
        14 => '捕猎开始',
        15 =>'随机商店刷新',
        16 => '购买商品',
        17 => '开启炉子',
        18 => '神秘商店',
        19 => '建筑加速',
        20 => '开始清理祭品',
        21 => '开始清理命运钥匙',
        22 => '结束清理祭品',
        23 => '结束清理命运钥匙',
        24 => '祭品扣费',
        25 => '命运钥匙扣费',
        26 => '祭品扣费,泉水',
        27 => '小宝箱抽奖消耗钻石 5连抽',
        28 => '小宝箱抽奖消耗钻石10连抽',
        29 => '大宝箱抽奖消耗钻石 5连抽',
        30 => '大宝箱抽奖消耗钻石10连抽',
        31 => '礼包购买',
        32 => '精准礼包购买',
        33 => '解锁天赋',
        34 => '重置天赋',
        35 =>'锻造消耗',
        36=>'gm减少货币',
        37=>'武器激活',
        38=>'离开地图删除',
        39=>'天赋升级',
        40=>'进入地图删除',
        41=>'商店兑换',
        42=>'购买宝物减少货币',
        43=>'客户端消耗星币',
        44=>'通行证扣除',
        45=>'巡逻扣除',
        46=>'挑战扣除',
        47=>'购买宠物物品',
        48=>'重铸消耗',
        49=>'扫荡',
        50=>'宠物能力突破',
        51=>'宠物能力2突破',
        52=>'大宝箱抽奖10连消耗钥匙',
        53=>'开始清理积分',
        54=>'神赐提取',
        55=>'大工匠槽升级',
        56=>'解锁头像',
        57=>'赏金任务重置',
        58=>'节日商店兑换扣费',
        59=>'节日活动节日货币1种子',
        60=>'节日活动节日货币2树叶',
        61=>'节日活动节日货币3鲜花',
        62=>'节日活动节日活动积分清理',
        63=>'节日抽奖',
        64=>'装备升星',
        65=>'宠物觉醒等级',
        66=>'宠物觉醒突破',
        67=>'活动3扣费日志',
        68=>'染色珍珠购买令牌',
        69=>'染色喂养令牌',
        70=>'小节日通行证兑换经验消耗金',
        71=>'学习天赋',
        72=>'小宝箱抽奖10连消耗钥匙',
        73=>'宠物钥匙抽奖消耗钥匙',
        74=>'宠物钥匙抽奖10连消耗钥匙',
        75=>'赛季重置货币移除',
        76=>'节日活动2节日货币1春联',
        77=>'节日活动2节日货币2爆竹',
        78=>'节日活动2节日货币3灯笼',
        79=>'节日活动2节日活动积分清理',
        80=>'开服宝箱',
        81=>'收集珍珠清理',
        82=>'收集珍珠清理',
        83=>'钓鱼消耗',
        84=>'赛季B重置货币移除',
        85=>'大工匠槽位突破',
        86=>'解锁时装槽',
        87=>'时装升级品质',
        88=>'远古重铸消耗',
        '2001' => '更新货币',
        '2002' => '增加体力',
        '2003' => '兑换表',
        '2004' => '章节奖励',
        '2005' => '小关卡胜利',
        '2006' => '小祈福',
        '2007' => '大祈福',
        '2008' => '直接充值到账',
        '2009' => '邮件充值充值到账',
        '2010' => '邮件获取货币',
        '2011' => '首冲',
        '2012' => '离线奖励',
        '2013' => '离线奖励2',
        '2014' => '/gm增加货币',
        '2015' => '建筑获取奖励',
        '2016' => '建筑里获取体力',
        '2017' => '建筑里获取石头',
        '2018' => '建筑里获取木头',
        '2019' => '建筑里获取石币',
        '2020' => '装备制作完成',
        '2021' => '捕猎结束',
        '2022' => '玩家升级',
        '2023' => '建筑里获取兽粮',
        '2024' => '建筑里获取天赋',
        '2025' => '神秘商店得到货币',
        '2026' => '领取锻造石',
        '2027' => '领取赛季奖励',
        '2028' => '开始增加祭品',
        '2029' => '开始增加命运钥匙',
        '2030' => '泉水里换取锻造石',
        '2031' => '泉水里换取石币',
        '2032' => '泉水里换区天赋石',
        '2033' => '使用物品',
        '2034' => '首次充值送的货币',
        '2035' => '签到奖励',
        '2036' => '礼包奖励',
        '2037' => '精准礼包奖励',
        '2038' => '月神大奖励',
        '2039' => '月神小奖',
        '2040' => '重置天赋',
        '2041' => '首冲奖励',
        '2042' => '累计奖励',
        '2043' => '分解',
        '2044' => '神罚奖励',
        '2045' => '泉水里hp换祭品',
        '2046' => '通行证奖励免费',
        '2047' => '通行证奖励付费',
        '2048' => '购买狩猎奖励',
        '2049' => '任务宝箱奖励',
        '2050' => '成就奖励',
        '2051' => '快速扫荡',
        '2052' => '祈福每日充值奖励',
        '2053' => '祈福每日累充奖励',
        '2054' => '技能没有,给祭品',
        '2055' => '建筑里获取石头',
        '2056' => '建筑里获取木头',
        '2057' => '建筑里获取石币',
        '2058' => '建筑里获取兽粮',
        '2059' => '建筑里获取天赋',
        '2060' => '领取锻造石',
        '2061' => '祈福每日充值奖励2',
        '2062' => '祈福每日充值奖励3',
        '2063' => '祈福每日累充奖励 循环累充',
        '2064' => '神灵祈祷经验',
        '2065' => '神灵祈祷经验兑换宝箱',
        '2066' => '累计奖励2',
        '2067' => '看视频特别奖励',
        '2068' => '分解提示',
        '2069' => '赏金任务奖励',
        '2070' => '节日任务奖励',
        '2071' => '节日任务兑换物品',
        '2072' => '赏金小任务奖励',
        '2073' => '领取排行榜奖励',
        '2074' => '节日掉落奖励',
        '2075' => '节日宝箱领取',
        '2076' => '湖中女神每日充值奖励4',
        '2077' => '大工匠图鉴奖励',
        '2078' => '湖中女神每日充值奖励5 第5天开启',
        '2079' => '小节日任务奖励',
        '2080' => '通行证奖励免费',
        '2081' => '通行证奖励珍珠付费',
        '2082' => '通行证奖励付费付费',
        '2083' => '绑定google',
        '2084' => '绑定facebook',
        '2085' => '消费任务奖励',
        '2086' => '开服签到奖励',
        '2087' => '开服累充(能量块统计)',
        '2088' => '每日累充(能量块统计)',
        '2089' => '基金',
        '2090' => '宠物抽奖',
        '2091' => '令牌任务奖励',
        '2092' => '自定义周卡签到奖励',
        '2093' => '染色通行证奖励免费',
        '2094' => '染色通行证奖励珍珠付费',
        '2095' => '染色通行证奖励付费付费',
        '2096' => '节日任务2奖励',
        '2097' => '节日任务2兑换物品',
        '2098' => '开服宝箱积分',
        '2099' => '收集珍珠增加',
        '2100' => '钓鱼奖励',
        '2101' => '宠物抽奖',
        '2102' => '赛季B任务奖励',
        '2103' => '分解提示远古装备制作',
        '2104' => '祈福每日充值奖励能量',
        '2105' => '祈福每日累充奖励能量',
    ],


    //礼包码状态
    12 => [
        '未使用',
        '已使用'
    ],

    //礼包码类型
    13 => [
        '单一礼包码',
        '通用礼包码',
        '单一礼包码(非限定)',
    ],

    //是否显示服务器
    14 => [
        '<span data-type="no" class="glyphicon glyphicon-remove" style="color: rgb(255,60,63);font-size: 20px;"></span>',//否
        '<span data-type="yes" class="glyphicon glyphicon-ok" style="color: rgb(10,191,0);font-size: 20px;"></span>'//是
    ],

    //货币增加类型
    17 => [
        '2001' => '更新货币',
        '2002' => '增加体力',
        '2003' => '兑换表',
        '2004' => '章节奖励',
        '2005' => '小关卡胜利',
        '2006' => '小祈福',
        '2007' => '大祈福',
        '2008' => '直接充值到账',
        '2009' => '邮件充值充值到账',
        '2010' => '邮件获取货币',
        '2011' => '首冲',
        '2012' => '离线奖励',
        '2013' => '离线奖励2',
        '2014' => '/gm增加货币',
        '2015' => '建筑获取奖励',
        '2016' => '建筑里获取体力',
        '2017' => '建筑里获取石头',
        '2018' => '建筑里获取木头',
        '2019' => '建筑里获取石币',
        '2020' => '装备制作完成',
        '2021' => '捕猎结束',
        '2022' => '玩家升级',
        '2023' => '建筑里获取兽粮',
        '2024' => '建筑里获取天赋',
        '2025' => '神秘商店得到货币',
        '2026' => '领取锻造石',
        '2027' => '领取赛季奖励',
        '2028' => '开始增加祭品',
        '2029' => '开始增加命运钥匙',
        '2030' => '泉水里换取锻造石',
        '2031' => '泉水里换取石币',
        '2032' => '泉水里换区天赋石',
        '2033' => '使用物品',
        '2034' => '首次充值送的货币',
        '2035' => '签到奖励',
        '2036' => '礼包奖励',
        '2037' => '精准礼包奖励',
        '2038' => '月神大奖励',
        '2039' => '月神小奖',
        '2040' => '重置天赋',
        '2041' => '首冲奖励',
        '2042' => '累计奖励',
        '2043' => '分解装备',
        '2044' => '合成装备',
        '2045' => '降品装备',
        '2046' => '商店购买',
        '2047' => '购买宝物',
        '2048' => '客户端增加星币',
        '2049' => '通行证获取奖励',
        '2050' => '巡逻获取奖励',
        '2051' => '签到获取奖励',
        '2052' => '签到box获取奖励',
        '2053' => '挑战获取奖励',
    ],

    //是否为线上
    18 => [
        '<span data-type="off" class="glyphicon glyphicon-remove" style="color: rgb(255,60,63);font-size: 20px;"></span>',//否
        '<span data-type="on" class="glyphicon glyphicon-ok" style="color: rgb(10,191,0);font-size: 20px;"></span>'//是
    ],

    //游戏是否显示
    19 => [
        '<span data-type="hide" class="glyphicon glyphicon-remove" style="color: rgb(255,60,63);font-size: 20px;"></span>',//否
        '<span data-type="show" class="glyphicon glyphicon-ok" style="color: rgb(10,191,0);font-size: 20px;"></span>'//是
    ],

    // 物品日志
    20 => [
        '1' => '装备槽升星',
        '2' => '装备槽升级',
        '3' => '建筑升级',
        '4' => '物品制作',
        '5' => '宝石嵌入',
        '6' => '建筑制作装备',
        '7' => '捕猎开始',
        '8' => '宠物解锁',
        '9' => '宠物升等级',
        '10' => '宠物升星',
        '11' => '随机门',
        '12' => '物品消耗',
        '13' => '礼包购买',
        '14' => '精准礼包购买',
        '15' => '解锁天赋',
        '16' => '开启炉子',
        '17' => '武器激活',
        '18' => '武器切换',
        '19' => '天赋升级',
        '20' => '合成装备',
        '21' => '降品装备',
        '22' => '商店购买',
        '23' => 'GM',
        '24' => '巡逻',
        '25' => '挑战',
        '26' => '装备槽随机',
        '27' => '宠物物品购买',
        '28' => '重铸消耗',
        '29' => '宠物能力1突破',
        '30' => '宠物能力2突破',
        '31' => '神赐提取消耗',
        '32' => '大工匠槽升级',
        '33' => '头像解锁',
        '34' => '节日商店购买扣费',
        '1001' => '更新物品',
        '1002' => '章节奖励',
        '1003' => '小关卡通关奖励',
        '1004' => '祈福小奖励',
        '1005' => '祈福大奖励',
        '1006' => 'gm创建物品',
        '1007' => '获取邮件附件',
        '1008' => '首冲',
        '1009' => '离线奖励',
        '1010' => '建筑获取奖励',
        '1011' => '建筑制作装备',
        '1012' => '捕猎结束',
        '1013' => '购买物品',
        '1014' => '物品制作获得',
        '1015' => '玩家升级',
        '1016' => '购买神秘商店',
        '1017' => '领取赛季奖励',
        '1018' => '使用物品',
        '1019' => '充值送的道具',
        '1020' => '签到奖励',
        '1021' => '礼包奖励',
        '1022' => '精准奖励',
        '1023' => '乐神大奖励',
        '1024' => '乐神小奖励',
        '1025' => '首冲奖励',
        '1026' => '累计充值',
        '1027' => '武器切换',
        '1028' => '分解奖励',
        '1029' => '合成奖励',
        '1030' => '降品奖励',
        '1031' => '商店购买',
        '1032' => '通行证获取奖励',
        '1033' => '巡逻获取奖励',
        '1034' => '签到获取奖励',
        '1035' => '签到box获取奖励',
        '1036' => '挑战宝箱获取奖励',
        '1037' => '快速扫荡',
        '1038' => '背包排序',
        '1039' => '祈福,每日充值奖励',
        '1040' => '祈福,每日累充奖励',
        '1041' => '祈福2,每日充值奖励2',
        '1042' => '祈福2,每日充值奖励3',
        '1043' => '祈福,每日累充奖励 循环累充',
        '1044' => '神灵祈祷经验获取经验',
        '1045' => '累计充值2',
        '1046' => '看视频特别奖励',
        '1047' => '分解物品显示',
        '1048' => '赏金任务奖励',
        '1049' => '节日任务奖励',
        '1050' => '节日商店兑换',
        '1051' => '赏金任务小任务奖励',
        '1052' => '领取排行榜奖励',
        '1053' => '节日掉落奖励',
        '1054' => '节日积分宝箱领取',
        '1055' => '湖中女神,每日充值奖励4',
        '1056' => '大工匠图鉴奖励',
        '1057' => '湖中女神,每日充值奖励5 第5天开启',
        '1058' => '小节日任务奖励',
        '1059' => '赛季任务奖励',
        '1060' => '宠物兑换商店增加',
        '1061' => '通行证奖励免费',
        '1062' => '通行证珍珠奖励付费',
        '1063' => '通行证奖励付费',
        '1064' => '消费任务奖励',
        '1065' => '开服签到奖励',
        '1066' => '开服累计充值(能量块)',
        '1067' => '每日累充充值(能量块)',
        '1068' => '基金奖励',
        '1069' => '宠物大奖励',
        '1070' => '令牌任务奖励',
        '1071' => '自定义周卡签到',
        '1072' => '染色通行证奖励免费',
        '1073' => '染色通行证珍珠奖励付费',
        '1074' => '染色通行证奖励付费',
        '1075' => '节日任务2奖励',
        '1076' => '节日商店2兑换',
        '1077' => '掉落奖励',
        '1078' => '赛季B任务奖励',
        '1079' => '分解物品远古装备制作',
        '1080' => '祈福,每日充值奖励 能量',
        '1081' => '祈福,每日累充奖励 能量',
        '1500' =>'交换装备'
    ],

    // 设备号
    21 => [
        '0',
        '8',
        '11'
    ],

    // 设备留存天数
    22 => [
        1,
        2,
        3,
        4,
        5,
        6,
        7,
        14,
        29,
        44,
        59
    ],

    27 => [
        [
            'id' => 6,
            'num' => '6'
        ],
        [
            'id' => 30,
            'num' => '30'
        ],
        [
            'id' => 68,
            'num' => '68'
        ],
        [
            'id' => 128,
            'num' => '128'
        ],
        [
            'id' => 328,
            'num' => '328'
        ],
        [
            'id' => 648,
            'num' => '648'
        ],

        [
            'id' => 207,
            'num' => '通行证'
        ],
        [
            'id' => 208,
            'num' => '普通月卡'
        ],
        [
            'id' => 209,
            'num' => '高级月卡'
        ],
        [
            'id' => 210,
            'num' => '基金1'
        ],
        [
            'id' => 211,
            'num' => '高级基金1'
        ],
        [
            'id' => 212,
            'num' => '基金2'
        ],
        [
            'id' => 213,
            'num' => '高级基金2'
        ],
        [
            'id' => 214,
            'num' => '基金3'
        ],
        [
            'id' => 215,
            'num' => '高级基金3'
        ],
    ],

    //权限分配时 开放全服的常量
    28 => [
        '1000'
    ],


    //分三次录入留存率
    30 => [
        1,
        2,
        3
    ],

    31 => [
        4,
        5,
        6,
        7
    ],

    32 => [
        14,
        29,
        44,
        59
    ],
    //游戏功能掩码开关
    35 => [
        [
            "value" =>1,
            "name" =>"福利兑换"
        ],
        [
            "value" =>2,
            "name" =>"充值"
        ],
        [
            "value" =>4,
            "name" =>"节日"
        ],
        [
            "value" =>8,
            "name" =>"充值icon"
        ],
        [
            "value" =>16,
            "name" =>"删档返还"
        ],
        [
            "value" =>32,
            "name" =>"充值档位开关"
        ],
        [
            "value" =>64,
            "name" =>"排行榜显示"
        ],
        [
            "value" =>128,
            "name" =>"充值按钮"
        ],
        [
            "value" =>256,
            "name" =>"特殊服"
        ],
    ],

    //定时任务
    37=>[
        [
            "value" =>"onServer",
            "name" =>"开服"
        ],
        [
            "value" =>"offServer",
            "name" =>"关服"
        ],
        [
            "value" =>"maintenance",
            "name" =>"维护"
        ],
        [
            "value" =>"cancel",
            "name" =>"取消维护"
        ],
        [
            "value" =>"show",
            "name" =>"显示"
        ],
        [
            "value" =>"hide",
            "name" =>"隐藏"
        ],
        [
            "value" =>"Online",
            "name" =>"开启汇总"
        ],
        [
            "value" =>"NoOnline",
            "name" =>"关闭汇总"
        ],
        [
            "value" =>"normal",
            "name" =>"常规"
        ],
        [
            "value" =>"isNew",
            "name" =>"新服标记"
        ],
        [
            "value" =>"Anchor",
            "name" =>"应用主播"
        ],
        [
            "value" =>"Opentime",
            "name" =>"设置开服时间"
        ],
        [
            "value" =>"isNotice",
            "name" =>"显示公告"
        ],
        [
            "value" =>"appversion",
            "name" =>"定时版本号"
        ],
        [
            "value" =>"groupNotice",
            "name" =>"福利更新公告"
        ]
    ],
    //IOS或安卓验码
    38 => [
        [
            "value" =>1,
            "name" =>"不显示进度条"
        ],
        [
            "value" =>2,
            "name" =>"开启提审弹窗"
        ],
        [
            "value" =>4,
            "name" =>"开启补丁更新"
        ],
        [
            "value" =>8,
            "name" =>"显示转圈"
        ],
        [
            "value" =>16,
            "name" =>"固定线程数"
        ],
        [
            "value" =>32,
            "name" =>"开启尾包"
        ],
        [
            "value" =>64,
            "name" =>"IOS提审"
        ],
        [
            "value" =>128,
            "name" =>"开启OBB下载"
        ],
        [
            "value" =>256,
            "name" =>"清理沙盒"
        ],
        [
            "value" =>512,
            "name" =>"打开广告"
        ],
        [
            "value" =>1024,
            "name" =>"关闭用户/隐私协议"
        ],
        [
            "value" =>2048,
            "name" =>"年龄限制"
        ]
    ],
    40 => [
        'LocalGate',
        'LocalServer',
        'ImportTool',
    ],

    //设备注册数（小时）分4次录
    42 => [
        0,
        1,
        2,
        3,
    ],
    43 => [
        4,
        5,
        6,
        7,
        8,
    ],
    44 => [
        9,
        14,
        29,
        44,
        59
    ],
    45 => [
        74,
        89,
        104,
        119
    ],
    46 => [
        149,
        179,
        209,
        239
    ],
    47 => [
        269,
        299,
        329,
        359
    ],
    //英文显示外币渠道
    49=>[
        '30000'
    ],
    52=>[
        '',//占位  没有0号时装
        '原始人',
        '海盗',
        '悟空',
        '忍者',
        '波斯王子',
        '冰精灵',
        '天国使者'
    ],
    //英文补单
    53 => [
        [
            'id' => 0.99,
            'num' => '0.99美元'
        ],
        [
            'id' => 4.99,
            'num' => '4.99美元'
        ],
        [
            'id' => 9.99,
            'num' => '9.99美元'
        ],
        [
            'id' => 19.99,
            'num' => '19.99美元'
        ],
        [
            'id' => 49.99,
            'num' => '49.99美元'
        ],
        [
            'id' => 99.99,
            'num' => '99.99美元'
        ],
        [
            'id' => 5.99,
            'num' => '珍珠卡'
        ],
        [
            'id' => 11.99,
            'num' => '资源卡'
        ],
        [
            'id' => 29.99,
            'num' => '特权卡'
        ],
    ],
    //redis
    55=>[
        'host'=>'127.0.0.1',
        'pwd'=>'fC9m2P6F'
    ],
    56=>[
        // 第一个参数 1开 0关 ;
        // 第二个参数 每2秒允许请求多少次;
        // 第三个参数 队列的长度
        // 第四个参数 队列的key
        [0,1000,10000,'getLoginLimit'], //登录
        [0,100,2000,'getPlaylevelLimit'], //上报等级
        [0,50,2000,'getServerLogLimit'],  //报错日志
        [0,5,20,'signinSure'],  //后台登录
    ],
    //礼包发送ip  dns解析有问题 直接ip访问
    57=>[
        'ip'=>[
            '192.168.1.169',
        ]
    ],
    //线上渠道
    58=>[0],
    //是否是全球服(多语言)
    59=>[0],
    62=>[
        ["new_getLoginList",60],//登录日志队列
        ["new_getClientData",100],//上报客户端数据队列
        ["new_countGameData",300],//上报游戏count
    ],
];




